app/controllers/posts_controller.rb

  def update
    #binding.pry
    @post = Post.find(params[:id])
    @post.update(params.require(:post))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "My Edit"], ["description", "My post description"], ["updated_at", "2016-01-27 20:09:01.104499"], ["id", 1]]